load-test.yml
config:
  target: "http://localhost:3002"
  phases:
    - duration: 30
      arrivalRate: 50
      rampTo: 50
      name: "Ramp up to 50 concurrent users"
  ensure:
    - statusCode: 200
  processor: "./processor.js"

scenarios:
  - name: "Get all quotes (unpaginated)"
    weight: 1
    flow:
      - get:
          url: "/api/quotes/unpaginated"
          capture:
            - json: "$"
              as: "unpaginatedResponse"

  - name: "Get paginated quotes (page 1, limit 20)"
    weight: 2
    flow:
      - get:
          url: "/api/quotes?page=1&limit=20"
          capture:
            - json: "$.pagination"
              as: "paginationMeta"

  - name: "Add to favorites"
    weight: 1
    flow:
      - post:
          url: "/api/favorites"
          json:
            quoteId: 42