load-test.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm-up phase"
    - duration: 120
      arrivalRate: 50
      name: "Ramp-up to 50 req/s"
    - duration: 60
      arrivalRate: 100
      name: "Sustained load 100 req/s"

scenarios:
  - name: "Paginated Mission Endpoint"
    flow:
      - get:
          url: "/api/missions?page=1&limit=20"
          expect:
            - statusCode: 200
            - contentType: json

  - name: "Different Pages"
    weight: 30
    flow:
      - get:
          url: "/api/missions?page={{ $randomNumber(1, 10) }}&limit=20"
          expect:
            - statusCode: 200
            - contentType: json

  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200